app/views/home/index.html.haml


      - Account.all.each do |accnt|
---
SELECT `accounts`.* FROM `accounts`