app/controllers/accounts_controller.rb

  def create
    params[:account][:identifier].gsub(' ', '.')
    @account = Account.create!(params[:account])
---
INSERT INTO `accounts` (`created_at`, `identifier`, `theme`, `updated_at`) VALUES ('2012-04-07 17:28:38', 'test', 'blogademia', '2012-04-07 17:28:38')